app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 6]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 6]]
---
  def index
    @post = Post.find(params[:post_id])
    @comments = @post.comments.all

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 8]]
INSERT INTO "comments" ("content", "post_id") VALUES ($1, $2) RETURNING "id"  [["content", "haaaay"], ["post_id", 8]]
---
  def create
    @post = Post.find(params[:post_id])
    @comment = @post.comments.create(comment_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 2]]
---
  def show
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 9]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 11]]
---
  def edit
    @post = Post.find(params[:post_id])
    @comment= Comment.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 29]]
---
  def update
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 5]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]
---
  def destroy
    @post = Post.find(params[:post_id])
    @comment = Comment.find(params[:id])
    @comment.destroy