app/controllers/posts_controller.rb

  def create
    @post = Post.create!(post_params)
---
INSERT INTO "posts" ("title", "content", "photo_url") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Mia's First Post"], ["content", "aewqe"], ["photo_url", "esrwerw"]]

  def update
    @post = Post.find(params[:id])
    @post.update(post_params)
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "posts" SET "title" = $1, "photo_url" = $2 WHERE "posts"."id" = $3  [["title", "Nig Data’s Radical Potential"], ["photo_url", ""], ["id", 6]]